#
# 2. Создайте переменные разных типов данных:
#   - Создайте переменную name и присвойте ей значение вашего имени (строка).
#   - Выведите значение переменной name на экран.
#   - Создайте переменную age и присвойте ей значение вашего возраста (целое число).
#   - Выведите значение переменной age на экран.
#   - Измените значение переменной age на новое значение (например, на age + 1).
#   - Выведите измененное значение переменной age на экран.
#   - Создайте переменную is_student и присвойте ей значение True (логическое значение).
#   - Выведите значение переменной is_student на экран.
#
# Примечания:
# - Для вывода значений на экран используйте функцию print().
# - Обратите внимание на использование разных типов данных и возможности их изменения.

name = 'Kseniya'
print('Name: ' + name)
age = 39
print('Age: ' + str(age))
age = 40
print('New age: ' + str(age))
is_student = True
print('Is student: ' + str(is_student))