# Напишите 4 переменных которые буду обозначать следующие данные:
# Количество выполненных ДЗ (запишите значение 12)
# Количество затраченных часов (запишите значение 1.5)
# Название курса (запишите значение 'Python')
# Время на одно задание (вычислить используя 1 и 2 переменные)
# Выведите на экран(в консоль), используя переменные, следующую строку:
# Курс: Python, всего задач:12, затрачено часов: 1.5, среднее время выполнения 0.125 часа.


count_of_homeworks = 12
count_of_hours = 1.5
course = 'Python'
time_for_one_task = count_of_hours / count_of_homeworks
print('Курс: ' + course + ', всего задач: ' + str(count_of_homeworks) + ', среднее время выполнения ' + str(time_for_one_task))
